.planning/case_profiles/case_006_v64_val_full_2_dicts/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| 0/p — case_006 ONERA M6 v64-val-full-2 (rhoSimpleFoam compressible).
| p_inf = 93,600 Pa (canonical Schmitt-Charpin reference T_inf=288K).
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; location "0"; object p; }

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 93600.0;

boundaryField
{
    "(farfield_upstream|farfield_downstream|farfield_top|farfield_bottom|farfield_outboard)"
    {
        type            freestreamPressure;
        freestreamValue uniform 93600.0;
        value           uniform 93600.0;
    }
    "(wing_surface_reference|tip_cap|root_fairing_pad|root_fairing_cover|tip_cap_sliver)"
    {
        type            zeroGradient;
    }
    symmetry_plane_root
    {
        type            symmetry;
    }
}
